llm/benchmark_results/20251028_113904/structured_choice/results_choice.txt
INFO 10-28 04:48:20 [__init__.py:216] Automatically detected platform cuda.
Namespace(backend='vllm', base_url='https://dotieuthien--example-vllm-openai-compatible-serve.modal.run', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset='choice', json_schema_path=None, max_concurrency=None, model='Qwen/Qwen2.5-VL-7B-Instruct-AWQ', tokenizer=None, tokenizer_mode='auto', num_prompts=100, output_len=128, request_rate=10.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, save_results=False, profile=False, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, no_structured_output=False, structured_output_ratio=1.0)
Input length of the prompt: 11 tokens
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 10.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
============ Serving Benchmark Result ============
Successful requests:                     100       
Request rate configured (RPS):           10.00     
Benchmark duration (s):                  27.96     
Total input tokens:                      1100      
Total generated tokens:                  7194      
Request throughput (req/s):              3.58      
Output token throughput (tok/s):         257.26    
Total Token throughput (tok/s):          296.60    
---------------Time to First Token----------------
Mean TTFT (ms):                          7375.52   
Median TTFT (ms):                        6595.19   
P99 TTFT (ms):                           16627.26  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          34.24     
Median TPOT (ms):                        33.34     
P99 TPOT (ms):                           47.38     
---------------Inter-token Latency----------------
Mean ITL (ms):                           34.18     
Median ITL (ms):                         0.01      
P99 ITL (ms):                            311.27    
==================================================
correct_rate(%) 0.0 



=== STDERR ===

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:02<04:40,  2.83s/it]
  2%|▏         | 2/100 [00:02<02:00,  1.23s/it]
  3%|▎         | 3/100 [00:03<01:17,  1.25it/s]
  5%|▌         | 5/100 [00:03<00:37,  2.51it/s]
  8%|▊         | 8/100 [00:04<00:26,  3.42it/s]
  9%|▉         | 9/100 [00:04<00:25,  3.63it/s]
 10%|█         | 10/100 [00:04<00:23,  3.85it/s]
 11%|█         | 11/100 [00:05<00:29,  2.99it/s]
 12%|█▏        | 12/100 [00:05<00:34,  2.56it/s]
 13%|█▎        | 13/100 [00:05<00:27,  3.21it/s]
 15%|█▌        | 15/100 [00:05<00:17,  4.87it/s]
 16%|█▌        | 16/100 [00:06<00:22,  3.69it/s]
 17%|█▋        | 17/100 [00:06<00:19,  4.25it/s]
 18%|█▊        | 18/100 [00:06<00:22,  3.59it/s]
 19%|█▉        | 19/100 [00:07<00:27,  2.93it/s]
 21%|██        | 21/100 [00:07<00:21,  3.75it/s]
 23%|██▎       | 23/100 [00:08<00:19,  3.87it/s]
 24%|██▍       | 24/100 [00:08<00:19,  3.87it/s]
 25%|██▌       | 25/100 [00:08<00:19,  3.90it/s]
 26%|██▌       | 26/100 [00:08<00:17,  4.21it/s]
 27%|██▋       | 27/100 [00:09<00:16,  4.49it/s]
 28%|██▊       | 28/100 [00:09<00:13,  5.18it/s]
 29%|██▉       | 29/100 [00:09<00:15,  4.45it/s]
 30%|███       | 30/100 [00:09<00:18,  3.86it/s]
 31%|███       | 31/100 [00:10<00:20,  3.30it/s]
 32%|███▏      | 32/100 [00:10<00:21,  3.10it/s]
 33%|███▎      | 33/100 [00:10<00:22,  2.99it/s]
 35%|███▌      | 35/100 [00:11<00:17,  3.68it/s]
 36%|███▌      | 36/100 [00:11<00:21,  3.01it/s]
 38%|███▊      | 38/100 [00:12<00:17,  3.60it/s]
 40%|████      | 40/100 [00:12<00:14,  4.10it/s]
 42%|████▏     | 42/100 [00:13<00:14,  3.92it/s]
 44%|████▍     | 44/100 [00:13<00:10,  5.24it/s]
 48%|████▊     | 48/100 [00:13<00:05,  9.01it/s]
 50%|█████     | 50/100 [00:14<00:08,  6.04it/s]
 52%|█████▏    | 52/100 [00:14<00:11,  4.19it/s]
 53%|█████▎    | 53/100 [00:15<00:12,  3.91it/s]
 55%|█████▌    | 55/100 [00:15<00:12,  3.60it/s]
 56%|█████▌    | 56/100 [00:16<00:14,  3.10it/s]
 58%|█████▊    | 58/100 [00:16<00:09,  4.36it/s]
 59%|█████▉    | 59/100 [00:16<00:08,  4.59it/s]
 60%|██████    | 60/100 [00:17<00:10,  3.82it/s]
 62%|██████▏   | 62/100 [00:17<00:06,  5.51it/s]
 64%|██████▍   | 64/100 [00:17<00:06,  5.68it/s]
 65%|██████▌   | 65/100 [00:17<00:05,  6.01it/s]
 66%|██████▌   | 66/100 [00:17<00:06,  5.26it/s]
 67%|██████▋   | 67/100 [00:18<00:07,  4.44it/s]
 68%|██████▊   | 68/100 [00:19<00:15,  2.12it/s]
 70%|███████   | 70/100 [00:20<00:13,  2.17it/s]
 72%|███████▏  | 72/100 [00:20<00:10,  2.63it/s]
 73%|███████▎  | 73/100 [00:21<00:11,  2.41it/s]
 74%|███████▍  | 74/100 [00:21<00:11,  2.26it/s]
 76%|███████▌  | 76/100 [00:22<00:06,  3.47it/s]
 77%|███████▋  | 77/100 [00:22<00:05,  3.98it/s]
 78%|███████▊  | 78/100 [00:22<00:05,  3.72it/s]
 79%|███████▉  | 79/100 [00:23<00:07,  2.93it/s]
 80%|████████  | 80/100 [00:23<00:06,  3.14it/s]
 82%|████████▏ | 82/100 [00:23<00:03,  4.56it/s]
 84%|████████▍ | 84/100 [00:24<00:04,  3.74it/s]
 85%|████████▌ | 85/100 [00:24<00:04,  3.75it/s]
 86%|████████▌ | 86/100 [00:25<00:06,  2.32it/s]
 88%|████████▊ | 88/100 [00:25<00:03,  3.06it/s]
 90%|█████████ | 90/100 [00:25<00:02,  4.24it/s]
 91%|█████████ | 91/100 [00:26<00:02,  3.84it/s]
 92%|█████████▏| 92/100 [00:26<00:02,  3.16it/s]
 94%|█████████▍| 94/100 [00:27<00:01,  4.18it/s]
 95%|█████████▌| 95/100 [00:27<00:01,  4.24it/s]
 96%|█████████▌| 96/100 [00:27<00:00,  4.77it/s]
 97%|█████████▋| 97/100 [00:27<00:00,  4.74it/s]
 98%|█████████▊| 98/100 [00:27<00:00,  4.30it/s]
100%|██████████| 100/100 [00:27<00:00,  6.47it/s]
100%|██████████| 100/100 [00:27<00:00,  3.58it/s]